In [2]:
# 라이브러리 로드
# import 라이브러리명 as 별칭
# from 라이브러리명 import 라이브러리 안의 특정 기능
# 라이브러리 명 홈페이지에서 documentation 보면 다 나와있음
import pandas as pd

In [3]:
# pandas 안에 있는 Series 라는 클래스 생성
series_1 = pd.Series(
    [5000, 6000, 6500, 6500]
)

In [4]:
series_1

0    5000
1    6000
2    6500
3    6500
dtype: int64

In [5]:
series_2 = pd.Series(
    ['A', 'B', 'C']
)

In [6]:
series_2

0    A
1    B
2    C
dtype: object

In [7]:
# 원소들의 타입이 다른 경우 dtype 생성은?
series_3 = pd.Series(
    ['A', 10, True]
)

In [8]:
series_3

0       A
1      10
2    True
dtype: object

In [9]:
# value 각각을 보면 type 통일 X
type(series_3[2])

bool

In [10]:
# Series 라는 class 에는 적어도 2개의 변수가 존재
# 값들이 저장되어있는 values
# values의 키값인 index
print("Series에서 values는 ", series_1.values)
print("Series에서 index는 ", series_1.index)

Series에서 values는  [5000 6000 6500 6500]
Series에서 index는  RangeIndex(start=0, stop=4, step=1)

In [11]:
series_1[1] = 5500

In [12]:
series_1

0    5000
1    5500
2    6500
3    6500
dtype: int64

In [13]:
series_1.values

array([5000, 5500, 6500, 6500])

In [14]:
series_1.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
series_1[100] = 40
series_1

0      5000
1      5500
2      6500
3      6500
100      40
dtype: int64

In [16]:
# values 값 바꾸기
series_1[3] = 30
series_1

0      5000
1      5500
2      6500
3        30
100      40
dtype: int64

In [17]:
# series 안의 index 바꿔주기
series_1.index = [0, 1, 1, 2, 3]

In [18]:
# index가 values의 길이와 맞지 않는 경우 에러 발생
# series_1.index = [0, 1, 1, 2, 3, 4]

# index 하나만 변경 -> 에러
# series_1[2] = 3

In [19]:
series_1.index

pandas.core.indexes.base.Index

In [132]:
# 데이터프레임 생성
_values = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
_index = ['a', 'b', 'c']
_cols= ['A', 'B', 'C']

df = pd.DataFrame(_values, index = _index, columns = _cols)

In [133]:
df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [134]:
print(df)

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [135]:
# rename() 함수를 이용해서 특정 인덱스나 특정 컬럼을 변경
# df의 컬럼 중 B 컬럼의 이름을 F로 변경
df = df.rename(
    columns = {
        'B' : 'F'
    },
    inplace = False
)

In [136]:
df

   A  F  C
a  1  2  3
b  4  5  6
c  7  8  9

In [137]:
# 복사본 생성
df2 = df.copy()

In [138]:
df2 = df2.rename(
    columns ={
        'A' : 'C',
    }, inplace = True
)
df2

In [139]:
df2
# inplace가 True이면 return 으로 되돌려주는 데이터가 존재하지 않는다.
# df2 = None 들어가는 형태로 df2의 데이터를 모두 제거

In [140]:
print(df2)

None

In [141]:
# DataFrame 안에 있는 colums 변수의 데이터를 변경
df.columns = ['name', 'age', 'loc']

In [142]:
df

   name  age  loc
a     1    2    3
b     4    5    6
c     7    8    9

####

In [158]:
df = pd.read_csv(
    "//Users/eunseo/Documents/data_boot/lecture/code/week2/csv/example.csv"
)

In [159]:
type(df)

pandas.core.frame.DataFrame

#### pandas 라이브러리를 이용하여 외부의 데이터파일 로드 
- csv, tsv
    - 가장 단순한 형태의 데이터 파일 
    - pandas 안에 내장된 read_csv() 함수를 이용하여 로드 
    - csv는 데이터를 ',' 기준으로 나눠준다. 
        - read_csv()를 기본값으로 사용 
    - tsv는 데이터를 '\t' 기준으로 나눠준다. 
        - read_csv() 함수에서 sep 매개변수에 인자값을 '\t' 대입
- json
    - 많이 사용하는 데이터의 파일
    - python을 기준으로 생각하면 dict 형태와 같다
    - pandas 안에 read_json() 함수를 이용하여 로드 
- xml 
    - html 구조 언어와 같이 tag를 이용하여 데이터 구성 
    - pandas 안에 read_xml() 함수를 이용하여 로드 
- 공통적으로 사용이되는 매개변수 
    - encoding 매개변수 
        - 기본값은 'UTF-8'
        - 데이터 파일을 로드 하는데 해당 데이터에 한글이 존재할때 종종 에러가 발생 ( decode error )
            - 'CP949', 'EUC-KR'로 매개변수에 대입 에러가 해결
        - 엑셀파일을 로드하는 함수에서는 encoding 매개변수가 존재하지 않는다. 
- excel ( xls, xlsx )
    - 엑셀 데이터 파일 
    - pandas 안에 read_excel() 함수를 이용
    - 특정 엑셀 파일을 로드 할때는 추가적인 라이브러리 설치 필요한 경우가 발생 
        - 해당 라이브러리가 설치가 되지 않은 경우에는 에러 발생 (모듈을 찾을수 없다.)
        - openpyxl 라이브러리를 설치하면 에러 해결 

- read_xxx() 공통적인 부분 
    - 첫번째 인자 : 파일의 경로

#### 경로 
- 절대 경로
    - 절대적인 주소값
    - 환경이 변하더라도 같은 위치를 언제나 지정 
    - ex)
        - window -> c:/users/admin/document/a.txt
        - mac -> ~/Desktop/a.txt
        - url -> https://www.google.com
- 상대 경로
    - 상대적인 주소값
    - 환경이 변할때 위치도 같이 변한다. 
    - 종류
        - ./ -> 현재 작업중인 디렉토리
        - ../ -> 상위(부모) 디렉토리 이동
        - 디렉토리명/ -> 하위(자식) 디렉토리 이동

In [145]:
# 상대 경로 이용
# 현재 디렉토리(./) -> 상위 디렉토리(../) -> csv 하위 디렉토리 이동(csv/)->example.csv
# 현재 디렉토리 생략 가능

df2 = pd.read_csv("csv/example.csv")

In [146]:
df2

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

In [147]:
# tsv 파일을 로드
# read_csv() 함수를 이용
# 상대경로

df3 = pd.read_csv("./csv/num_1/chipotle.tsv", sep = '/t')

/var/folders/v0/r6b3g15j6gd1x8947g8ly2qr0000gn/T/ipykernel_35774/1657562775.py:5: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df3 = pd.read_csv("./csv/num_1/chipotle.tsv", sep = '/t')

In [148]:
df3

     order_id\tquantity\titem_name\tchoice_description\titem_price
0       1\t1\tChips and Fresh Tomato Salsa\tNULL\t$2.39
1                       1\t1\tIzze\t[Clementine]\t$3.39
2                1\t1\tNantucket Nectar\t[Apple]\t$3.39
3     1\t1\tChips and Tomatillo-Green Chili Salsa\tN...
4     2\t2\tChicken Bowl\t[Tomatillo-Red Chili Salsa...
...                                                 ...
4617  1833\t1\tSteak Burrito\t[Fresh Tomato Salsa, [...
4618  1833\t1\tSteak Burrito\t[Fresh Tomato Salsa, [...
4619  1834\t1\tChicken Salad Bowl\t[Fresh Tomato Sal...
4620  1834\t1\tChicken Salad Bowl\t[Fresh Tomato Sal...
4621  1834\t1\tChicken Salad Bowl\t[Fresh Tomato Sal...

[4622 rows x 1 columns]

In [149]:
# json 데이터 로드

df4 = pd.read_json('./csv/2021/202103_expense_list.json')

In [150]:
df4.head(1)

,nid,title,url,dept_nm_lvl_1,dept_nm_lvl_2,dept_nm_lvl_3,dept_nm_lvl_4,dept_nm_lvl_5,exec_yr,exec_month,...,expense_execution,category,dept_nm_full,exec_dt,exec_loc,exec_purpose,target_nm,payment_method,exec_amount,bimok
0,22581299,2021년 3월 소방재난본부(소방서) 소방학교 소방과학연구센터 업무추진비 - 부서운영,http://opengov.seoul.go.kr/public/22581299,소방재난본부(소방서),소방학교,소방과학연구센터,,,2021,3,...,NaN,,소방학교 소방과학연구센터,2021-03-17 14:30,롯데마트 은평점(은평구 통일로 1051),부서운영물품구입(커피 등),센터장 윤영란 등 6명,제로페이,249210,부서

In [151]:
df5 = pd.read_xml("./csv/2021/202102_expense_list.xml")

In [152]:
# !pip install lxml

In [153]:
# 같은 경로에 있는 excel 파일 로드
df6 = pd.read_excel('./csv/2021/202101_expense_list.xlsx')

In [154]:
# !pip install openpyxl

In [155]:
# data 파일에서 한글때문에 에러가 발생하는 경우
# csv 폴더 안에 '주민등록.csv' 파일을 로드

df7 = pd.read_csv(
    "./csv/주민등록.csv", encoding = 'CP949'
)

In [156]:
df7.head(2)

,자치구코드(atdrc_code_se),자치구명(atdrc_nm),년월(년월),총인구수(tot_popltn_co),세대수(tot_hshld_co),세대당인구(hshld_popltn_avrg_co),남자인구수(male_popltn_co),여자인구수(female_popltn_co),적재일시(ldadng_dt)
0,금천구,11110,201907,228755,171426,2.44,319062,118352,2018-01-05 16:52:25
1,서대문구,11290,201607,153780,186744,2.12,75614,116393,2018-12-05 10:20:57

#### 결측치
- 데이터프레임에서 특정 부분에 데이터가 존재하지 않는 경우
- NaN 표시